yingshaoxo/super_led_fan/MSP430F169/main.c
            char text[1];
            int_to_string(number, text, 1);
            strcat(input_string, text);
            print_string(0, 1, input_string);
        } else if (number == 14 || number == 15) {
            if (strcmp(input_string, "") == 0) {
                state = -1;
                strcpy(input_string, "");
                parameter1 = -1;
                parameter2 = -1;
                parameter3 = -1;

                clean_LCD_menu();
                print_string(0, 1, "Which Task?");
                return;
            }
            state += 1;
            if (state == 0) {
                int target_number = atoi(input_string);
                task_number_from_keypad = target_number;
                strcpy(input_string, "");

                clean_LCD_menu();
                print_string(0, 1, "Parameter1?");
            } else if (state == 1) {
                int target_number = atoi(input_string);
                parameter1 = target_number;
                strcpy(input_string, "");

                clean_LCD_menu();
                print_string(0, 1, "Parameter2?");
            } else if (state == 2) {
                int target_number = atoi(input_string);
                parameter2 = target_number;
                strcpy(input_string, "");

                clean_LCD_menu();
                print_string(0, 1, "Parameter3?");
            } else if (state == 3) {
                int target_number = atoi(input_string);
                parameter3 = target_number;
                strcpy(input_string, "");

                clean_LCD_menu();
                print_string(0, 1, "Back to menu?");
            } else {
                state = -1;
                strcpy(input_string, "");
                parameter1 = -1;
                parameter2 = -1;
                parameter3 = -1;

                clean_LCD_menu();
                print_string(0, 1, "Which Task?");
                return;
            }
        } else if (number == 11 || number == 12 || number == 13) {
            state = -1;
            strcpy(input_string, "");
            parameter1 = -1;
            parameter2 = -1;
            parameter3 = -1;

            clean_LCD_menu();
            print_string(0, 1, "Which Task?");
            return;
        }
    }

    // handle all tasks here
    print_number(0, 2, task_number_from_keypad);
    if (parameter1 != -1) {
        print_number(0, 3, parameter1);
    }
    if (parameter2 != -1) {
        print_number(0, 4, parameter2);

        if (parameter3 != -1) {
            char text[20];
            sprintf(text, "%d       %d", parameter2, parameter3);
            print_string(0, 4, text);
        }
    }

    if (task_number_from_keypad == 5) {
        if (parameter3 != -1) {
            if (an_image_received == 1) {
                clean_LCD_menu();
                draw_picture_from_serial();
                an_image_received = 0;
            }
        } else if (parameter2 != -1) {
            if (an_image_received == 1) {
                clean_LCD_menu();
                draw_picture_from_serial();
                an_image_received = 0;
            }
        } else if (parameter1 != -1) {
            if (an_image_received == 1) {
                clean_LCD_menu();
                draw_picture_from_serial();
                an_image_received = 0;
            }
        }
    }

    if (task_number_from_keypad == 6) {
        if (parameter3 != -1) {
            if (an_image_received == 1) {
                for (dnum = 0; dnum < 256; dnum++) {
                    if (dnum < 128) {
                        Idex = 0 + 32*3;
                    } else {
                        Idex = 16 + 32*3;
                    }
                    if (an_image[dnum] == 1) {
                        point_square[Idex + dnum%16] |= (0x80>>(dnum/16));
                    } else {
                        point_square[Idex + dnum%16] &= ~(0x80>>(dnum/16));
                    }
                }
                show_task6 = 1;
                an_image_received = 0;
            }
        } else if (parameter2 != -1) {
            if (an_image_received == 1) {
                for (dnum = 0; dnum < 256; dnum++) {
                    if (dnum < 128) {
                        Idex = 0 + 32*2;
                    } else {
                        Idex = 16 + 32*2;
                    }
                    if (an_image[dnum] == 1) {
                        point_square[Idex + dnum%16] |= (0x80>>(dnum/16));
                    } else {
                        point_square[Idex + dnum%16] &= ~(0x80>>(dnum/16));
                    }
                }
                an_image_received = 0;
            }
        } else if (parameter1 != -1) {
            if (an_image_received == 1) {
                for (dnum = 0; dnum < 256; dnum++) {
                    if (dnum < 128) {
                        Idex = 0 + 32*1;
                    } else {
                        Idex = 16 + 32*1;
                    }
                    if (an_image[dnum] == 1) {
                        point_square[Idex + dnum%16] |= (0x80>>(dnum/16));
                    } else {
                        point_square[Idex + dnum%16] &= ~(0x80>>(dnum/16));
                    }
                }
                an_image_received = 0;
            }
        }
    } else { // if not task 6
        show_task6 = 0;
    }
}

#pragma vector = USART0RX_VECTOR
__interrupt void usart0_rx(void) {
    while (!(IFG1 & UTXIFG0)) {
        // USART0 TX buffer ready?
    }
    STATE_FROM_SERIAL = (int)RXBUF0; // receive state
    //TXBUF0 = (unsigned char)STATE_YOU_WANT_TO_SEND; // send state

    if (STATE_FROM_SERIAL != 0 || data_arraving == 1) {
        if (data_arraving == 0) {
            TASK_NUMBER = STATE_FROM_SERIAL;
            if (TASK_NUMBER == 8) {
                an_image_received = 0;
            }
            data_arraving = 1;

        } else {
            if (TASK_NUMBER == 8) {     // handle image data
                if (data_index < 256) { // data_index = 255, actually the 256 element
                    if (STATE_FROM_SERIAL == 9) {
                        an_image[data_index] = 1;
                    } else {
                        an_image[data_index] = 0;
                    }
                } else { // data_index == 256, actually the 257 element
                    image_index = STATE_FROM_SERIAL;
                }
            }
            if (TASK_NUMBER == 11) { // handle keypad data
                if (data_index == 0) {
                    KeyPad_value = STATE_FROM_SERIAL;
                }
                if (data_index == 1) {
                    new_KeyPad_state = STATE_FROM_SERIAL;
                }
            }

            data_index += 1;

            if (data_index > 256) {
                data_arraving = 0;
                data_index = 0;
                if (TASK_NUMBER == 8) { // handle image data after data transmission finished
                    an_image_received = 1;
                }
                if (TASK_NUMBER == 11) { // handle keypad data after data transmission finished
                    if (old_KeyPad_state != new_KeyPad_state) {
                        // do something
                        handle_keypad_key(KeyPad_value);
                    }
                    old_KeyPad_state = new_KeyPad_state;
                }
            }
        }
    } else {
        TASK_NUMBER = 0;
    }
}

int main(void) {
    WDTCTL = WDTPW | WDTHOLD; // stop watchdog timer

    initialize_LCD();
    initialize_serial_communication();
    initialize_infrared_sensor();
    initialize_16_rows_LED();

    print_string(0, 1, "Which Task?");
    while (1) {
        if (enter_pin_interrupt == 1) {
            switch (task_number_from_keypad) {
            case 0:
                break;
            case 1:
                if (parameter1 != -1 && parameter2 != -1) {
                    task1(parameter1, parameter2);
                }
                break;
            case 2:
                task2();
                break;
            case 3:
                task3();
                break;
            case 4:
                task4();
                break;
            case 5:
                task5();
                break;
            case 6:
                break;
            case 7:
                break;
            default:
                break;
            }
            enter_pin_interrupt = 0;
        }
    }

    return 0;
}
